-- Тестовые данные

INSERT INTO teachers (full_name, email) VALUES
('Иванов Иван Иванович', 'ivanov@university.ru'),
('Петрова Анна Сергеевна', 'petrova@university.ru'),
('Сидоров Максим Олегович', 'sidorov@university.ru'),
('Смирнова Ольга Викторовна', 'smirnova@university.ru'),
('Кузнецов Дмитрий Андреевич', 'kuznetsov@university.ru'),
('Попова Елена Михайловна', 'popova@university.ru'),
('Васильев Артём Игоревич', 'vasiliev@university.ru'),
('Соколова Мария Павловна', 'sokolova@university.ru'),
('Морозов Алексей Николаевич', 'morozov@university.ru'),
('Волкова Наталья Романовна', 'volkova@university.ru');


INSERT INTO student_groups (name, course) VALUES
('Б9123-09.03.03', 1),
('Б9124-09.03.03', 1),
('Б9223-09.03.03', 2),
('Б9224-09.03.03', 2),
('Б9323-09.03.03', 3),
('Б9324-09.03.03', 3),
('Б9423-09.03.03', 4),
('Б9424-09.03.03', 4),
('Б9125-09.03.03', 1),
('Б9225-09.03.03', 2);


INSERT INTO rooms (building, room_number, capacity) VALUES
('A', '101', 30),
('A', '102', 25),
('A', '201', 40),
('A', '202', 35),
('B', '101', 20),
('B', '102', 30),
('B', '201', 45),
('B', '202', 25),
('C', '301', 50),
('C', '302', 40);


INSERT INTO disciplines (name) VALUES
('Базы данных'),
('Программирование'),
('Информационные системы'),
('Компьютерные сети'),
('Операционные системы'),
('Веб-разработка'),
('Математика'),
('Алгоритмы и структуры данных'),
('Системный анализ'),
('Проектирование информационных систем');


-- Связь N:M между группами и дисциплинами

INSERT INTO group_disciplines (group_id, discipline_id) VALUES
(1, 1),
(1, 2),

(2, 2),
(2, 3),

(3, 3),
(3, 4),

(4, 4),
(4, 5),

(5, 5),
(5, 6),

(6, 6),
(6, 7),

(7, 7),
(7, 8),

(8, 8),
(8, 9),

(9, 9),
(9, 10),

(10, 10),
(10, 1);


-- Время учебных пар

INSERT INTO pair_slots (pair_number, starts_at, ends_at) VALUES
(1, '07:00', '08:20'),
(2, '08:30', '09:50'),
(3, '10:00', '11:20'),
(4, '11:30', '12:50'),
(5, '13:00', '14:20'),
(6, '14:30', '15:50'),
(7, '16:00', '17:20'),
(8, '17:30', '18:50'),
(9, '19:00', '20:20'),
(10, '20:30', '21:50');

-- Расписание

INSERT INTO schedule_entries
(group_id, discipline_id, teacher_id, room_id, pair_slot_id, lesson_date)
VALUES

(1, 1, 1, 1, 1, '2026-10-12'),
(2, 2, 2, 2, 2, '2026-10-12'),
(3, 3, 3, 3, 3, '2026-10-12'),
(4, 4, 4, 4, 4, '2026-10-12'),
(5, 5, 5, 5, 5, '2026-10-12'),

(6, 6, 6, 6, 1, '2026-10-13'),
(7, 7, 7, 7, 2, '2026-10-13'),
(8, 8, 8, 8, 3, '2026-10-13'),
(9, 9, 9, 9, 4, '2026-10-13'),
(10, 10, 10, 10, 5, '2026-10-13'),

(1, 2, 6, 6, 1, '2026-10-14'),
(2, 3, 7, 7, 2, '2026-10-14'),
(3, 4, 8, 8, 3, '2026-10-14'),
(4, 5, 9, 9, 4, '2026-10-14'),
(5, 6, 10, 10, 5, '2026-10-14'),

(6, 7, 1, 1, 1, '2026-10-15'),
(7, 8, 2, 2, 2, '2026-10-15'),
(8, 9, 3, 3, 3, '2026-10-15'),
(9, 10, 4, 4, 4, '2026-10-15'),
(10, 1, 5, 5, 5, '2026-10-15');